[
{"name": "The Children in my House’s Walls", "rating": "9.34", "date": "July 2, 2024", "description": "The head in the wall was crusted and decayed, mummified in its plastic shroud, the withered face open-mouthed in a scream—or maybe the jaw had loosened as the muscles decayed. The plastic is what held in ...", "link": "https://www.creepypasta.com/the-children-in-my-houses-walls/"},
{"name": "The Mind Mirror", "rating": "9.34", "date": "June 15, 2024", "description": "The mind is a complex thing that no one can truly hope to fully understand. You can study it all day long but there are things inside that defy all human logic. In a way we ...", "link": "https://www.creepypasta.com/the-mind-mirror/"},
{"name": "He Who Wanders", "rating": "9.13", "date": "January 24, 2017", "description": "I missed the scorching wind of Andalusia. How it pours sunlight onto your face, toying with eyelashes, flattening dry sand against cheeks and milling around hair. I missed the smell of the valley and that ripening ...", "link": "https://www.creepypasta.com/he-who-wanders/"},
{"name": "Psychosis", "rating": "9.11", "date": "November 3, 2010", "description": "Sunday I’m not sure why I’m writing this down on paper and not on my computer. I guess I’ve just noticed some odd things. It’s not that I don’t trust the computer… I just… need to ...", "link": "https://www.creepypasta.com/psychosis/"},
{"name": "If You’re Armed and at the Glenmont Metro, Please Shoot Me", "rating": "9.1", "date": "February 20, 2020", "description": "If you’re armed and at the Glenmont metro, please shoot me. Make it a headshot. Shoot me in the temple, aiming slightly downwards. I need the bullet to travel the shortest possible distance through my brain ...", "link": "https://www.creepypasta.com/if-youre-armed-and-at-the-glenmont-metro-please-shoot-me/"},
{"name": "Ticci-Toby", "rating": "9.1", "date": "March 2, 2015", "description": "The long road home seemed to go on and on. The road continued to stretch in front of the vehicle endlessly. The light that shone through the branches of the tall, green trees danced across the ...", "link": "https://www.creepypasta.com/ticci-toby/"},
{"name": "The Seer of Possibilities", "rating": "9.1", "date": "January 26, 2015", "description": "Sometimes, otherworldly beings find interesting ways to try and contact you. They might use a Ouija Board, or maybe come to you in a dream, or sometimes they speak through another person. They each have their ...", "link": "https://www.creepypasta.com/the-seer-of-possibilities/"},
{"name": "I Found a Letter From My Stalker", "rating": "9.09", "date": "January 6, 2019", "description": "I found this note, nailed onto a tree on my front lawn. I really don't know how to describe it. I'll just let you read it yourself. [Note start] I saw you today. It was your ...", "link": "https://www.creepypasta.com/i-found-a-letter-from-my-stalker/"},
{"name": "The Melancholy of Herbert Solomon", "rating": "9.09", "date": "December 28, 2012", "description": "On several occasions my interest in the supernatural has taken me to some of the most prestigious seats of learning in the entire United Kingdom. From the venerable halls of Oxford and Cambridge, to the more ...", "link": "https://www.creepypasta.com/the-melancholy-of-herbert-solomon/"},
{"name": "Bedtime", "rating": "9.09", "date": "October 11, 2012", "description": "  Part One: The Beginning Bedtime is supposed to be a happy event for a tired child; for me it was terrifying. While some children might complain about being put to bed before they have finished ...", "link": "https://www.creepypasta.com/bedtime/"},
{"name": "Demented Marionette", "rating": "9.08", "date": "November 9, 2022", "description": "I watched the fog creep along the ground and through the treeline at the edge of the property in a daze. I had been staring for a while, slowly realizing that I was still tightly gripping ...", "link": "https://www.creepypasta.com/demented-marionette/"},
{"name": "Herobrine", "rating": "9.08", "date": "October 30, 2010", "description": "I had recently spawned a new world in single-player Minecraft. Everything was normal at first as I began chopping down trees and crafting a workbench. I noticed something move amongst the dense fog (I have a ...", "link": "https://www.creepypasta.com/herobrine/"},
{"name": "Don’t Let Them In", "rating": "9.08", "date": "May 28, 2019", "description": "Addiction took our mother slowly, rocked her through it and sung her to sleep sunk deep into the mattress on her bed. When her back teeth fell out, she left them on the side of the ...", "link": "https://www.creepypasta.com/dont-let-them-in/"},
{"name": "A Shattered Life", "rating": "9.08", "date": "July 22, 2020", "description": "I don't know when you're going to read this, but I can tell you when it started: I was out for a walk alone in the woods when the entity came for me. It was beyond ...", "link": "https://www.creepypasta.com/a-shattered-life/"},
{"name": "Ben Drowned", "rating": "9.08", "date": "December 19, 2017", "description": "Finally, after a long day you get a moment to yourself. You take a deep breath, sigh out the weight of the day’s pressures and collapse onto a bean bag, lifting the controller, to load up ...", "link": "https://www.creepypasta.com/ben-drowned/"},
{"name": "Turn It Off", "rating": "9.08", "date": "August 25, 2016", "description": "I rested my arms behind my head, skim-reading the credits of a movie I'd just watched. After seeing them through about half way, I lifted myself from the sofa and walked to the kitchen, stretching my ...", "link": "https://www.creepypasta.com/turn-it-off/"},
{"name": "Sadie", "rating": "9.08", "date": "January 7, 2014", "description": "“Watch out for Sadie.” “What?” “Watch out for Sadie. She haunts the garage.” I searched the face of Carol, the woman who had been training me for the past week, waiting to see her wink or ...", "link": "https://www.creepypasta.com/sadie/"},
{"name": "Mr. Widemouth", "rating": "9.08", "date": "October 25, 2010", "description": "During my childhood my family was like a drop of water in a vast river, never remaining in one location for long. We settled in Rhode Island when I was eight, and there we remained until ...", "link": "https://www.creepypasta.com/mr-widemouth/"},
{"name": "I am a foot soldier in a war against an alien race. This is my story.", "rating": "9.07", "date": "November 25, 2023", "description": "Read Part one here Read Part two here Read Part three here This is a message to the citizens of the planet Earth. I am speaking to all races and creeds, to the people of all ...", "link": "https://www.creepypasta.com/i-am-a-foot-soldier-in-a-war-against-an-alien-race-this-is-my-story/"},
{"name": "Among The Wolves", "rating": "9.07", "date": "July 28, 2022", "description": "Piotr Kowalczyk lived by a simple mantra, “Sweep and live.” He was an old man, nearly sixty-five, in July 1943 when the Nazis had rounded up all two hundred and thirty-five people in his small village ...", "link": "https://www.creepypasta.com/among-the-wolves/"}
]